Revit 2027 API
AssetPropertyDoubleArray4d.IsValidValue(Color) Method
 Checks that the value is a valid value for this property.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValidValue(
	Color color
)
Public Function IsValidValue (
	color As Color
) As Boolean
public:
bool IsValidValue(
	Color^ color
)
member IsValidValue :
        color : Color -> bool
Parameters
color Color
 The value to be checked.
Return Value
Boolean
 True if the value is valid for the property.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  Cannot check validity for a property not being edited in AppearanceAssetEditScope.
See Also
Reference
AssetPropertyDoubleArray4d Class
IsValidValue Overload
Autodesk.Revit.DB.Visual Namespace